#+STARTUP: overview indent inlineimages logdrawer
#+TITLE: Test Journal
#+AUTHOR: S'chn T'gai Spock
#+LANGUAGE:    en
#+TAGS: noexport(n) Stats(S)
#+TAGS: Teaching(T) R(R) OrgMode(O) Python(P)
#+EXPORT_SELECT_TAGS: Blog
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+COLUMNS: %25ITEM %TODO %3PRIORITY %TAGS
#+SEQ_TODO: TODO(t!) STARTED(s!) WAITING(w@) APPT(a!) | DONE(d!) CANCELLED(c!) DEFERRED(f!)

* LaTeX Configuration                                              :noexport:
  :latex_headers:
  #+LATEX_HEADER: \usepackage{blindtext}
  #+LATEX_HEADER: \usepackage{listings}
  :end:

* First Section
#+LATEX: \blindtext[1]

#+begin_SRC R :results output :session *R* :eval export :exports both
sessionInfo()
#+end_SRC

#+RESULTS:
#+begin_example
R version 4.0.5 (2021-03-31)
Platform: x86_64-pc-linux-gnu (64-bit)
Running under: Arch Linux

Matrix products: default
BLAS:   /usr/lib/libopenblasp-r0.3.14.so
LAPACK: /usr/lib/liblapack.so.3.9.1

locale:
 [1] LC_CTYPE=en_US.UTF-8       LC_NUMERIC=C
 [3] LC_TIME=en_US.UTF-8        LC_COLLATE=en_US.UTF-8
 [5] LC_MONETARY=en_US.UTF-8    LC_MESSAGES=en_US.UTF-8
 [7] LC_PAPER=en_US.UTF-8       LC_NAME=C
 [9] LC_ADDRESS=C               LC_TELEPHONE=C
[11] LC_MEASUREMENT=en_US.UTF-8 LC_IDENTIFICATION=C

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base

loaded via a namespace (and not attached):
[1] compiler_4.0.5
#+end_example

** First Subsection
#+LATEX: \blindtext[1]
#+LATEX: \blinditemize[5]

** Second Subsection
#+LATEX: \blindtext[1]
#+LATEX: \blindmathtrue
#+LATEX: \blindmathpaper

* Second Section
#+LATEX: \blindtext[1]

#+begin_SRC python :results output :session *Python* :eval export :exports both
import sys
print(sys.version)
#+end_SRC

#+RESULTS:
: 3.9.4 (default, Apr 20 2021, 15:51:38)
: [GCC 10.2.0]

#+LATEX: \blindmathtrue
#+LATEX: \blindmathpaper
